import './App.css';
import Posts from "./components/posts1/Posts";

function App() {
  return (
    <div className="App">
        <h2>Task_1</h2>
        <br />
        <br />
        <br />
      {/*з jsonplaceholder отримати всі пости в компоненту Posts.js*/}
      {/*відобразити кожного інформацію (id,title) з кожного поста (компонента Post)*/}
      {/*Зробити кнопку вибора поста, при натисканні на яку в Posts.js ви покажете детальну інфомацію про пост(всю інфу)*/}
      <Posts />

      {/*=====*/}
        <h2>Task_2</h2>
        <br />
        <br />
      {/*є API от SpaceX*/}
      {/*https://api.spacexdata.com/v3/launches/*/}
      {/*потрібно вивести всі запуски кораблів окрім 2020 року*/}
      {/*репрезентувати тільки окремі поля (зазначені в скрнішоті в папці)*/}



      {/*#Advance*/}
      {/*вивести всіх юзерів з плайсхолдеру*/}
      {/*в кожного юзера має бути кнопка яка буде показувати пости цього юзера*/}
      {/*пости мають виводитись під компонетою Users (в App компоненті)*/}

    </div>
  );
}

export default App;
